{

    "app.next":"Nächste",
    "app.prev":"Vorherige",
    "app.backToMain":"Zurück zum Anfang",
    "app.projectsheader":"Letzte Projekte",
    "app.project1": "Jobportal mit AI-Integration und E-Mail-Service mit über 1 Million Stellenangeboten und mehreren tausend versendeten Bewerbungen.",
    "app.project11": "On Premise LLMs als RAG-System und weitere KI-Services",

    "app.project2": "Direktes On-Chain-NFT-Zeichenwerkzeug",
    "app.project3": "Den Code zu dieser Website finden Sie hier",    
    "app.tableButton":"Tabelle",    
    "app.doubleHelixButton": "Doppelhelix",
    "app.sphereButton": "Kugel",
    "app.helixButton": "Helix",
    "app.gridButton": "Raster",
    "app.circleButton": "Kreis",
    "app.treeButton": "Baum",
    "app.testButton": "Fraktaler Baum",
    

    "app.header":"Editiere <code>{fileName}<code> js und speichern zum laden.",
    "app.toLeftArrow": "andere Programmiersprachen",
"app.toRightArrow": "Java",
"app.toTopArrow": "AJAX",
"app.toButtomArrow": "DevOps und mehr",
"app.toBackToMain":"Zurück zum Anfang",

"app.welcome": "Willkommen in meinem Portfolio, ich bin Artur, 30, und meine Leidenschaft ist es, die Welt mit den neuesten Technologien voranzubringen. Meine derzeitigen Lieblingstechnologien sind LLMs, KI-Webagenten, RAG-Systeme und Scrapy. Ich liebe es, Dinge durch Code zu erschaffen und mich um meine Kreationen zu kümmern."
,    "app.me":"Ich bin Artur, 30 und meine Leidenschaft ist das Programmieren. Ich liebe es mit Code neue Dinge zu schaffen und die Entwicklung meiner Kreationen voran zutreiben. ",
    "app.contact":"Hinterlassen Sie mir gerne eine Nachricht",
    "app.card1":"Die Entwicklung von Backend oder Microservices mit JavaEE oder SpringBoot/ Quarkus  Neben der Realisierung von Software gehört das Testen des Backends mit JUnit4/5 oder des Frontends mit Selenide/ Selenium ebenfalls zu meinen Stärken.",
    "app.card2":"Meine erste Android App, welche ich für einen Vertriebspartner der EWE erstellt habe, findet dort bereits ein einigen Jahren Ihren Einsatz.",
    "app.card3":"Zusätzlich empfinde ich viel Freude bei der Auswertung von Daten, welche ich mir von Zeit zu Zeit mit einem WebScraper ziehe.",
    "app.card4":"Zu den Data Science Skills mit Python und R kommen hervorangede Kenntnisse mit SQL und den dazugehörigen Tools hinzu.",
    "app.card5":"Ebenso bin ich seit Sommer letzten Jahres im Projektmanagement in der SaaS-Branche tätig und übernehme dort Verantwortung für Kundenprojekte.",
    "app.card6":"Mein Profil runden solide Skills mit in CI/ CD mit Jenkins, Version Controll mit GitHub oder GitLab unabhängig vom Bertriebssystem ab.",
    "app.card7":"Während Praktikums und des Studiums hatte ich außerdem erste Berührungspunkte mit SAP und Salesforce.",
    "app.card8":"Ein weiteres Hobby von mir ist die Spieleprogrammierung mit Unity und der Serveraufbau für Cryptomining.",
   
   
    "app.java":"Als erfahrener Java-Entwickler verfüge ich über umfassende Kenntnisse in der Programmierung mit der Java-Plattform. Durch meine jahrelange Erfahrung habe ich mich mit den verschiedenen Aspekten der Java-Entwicklung vertraut gemacht und kann effiziente, leistungsfähige und skalierbare Anwendungen erstellen, die den modernen Anforderungen des Marktes gerecht werden.",
    "app.springboot":"Im Bereich Spring Boot konnte ich mein Wissen und meine Fähigkeiten durch die Arbeit an zahlreichen Projekten weiter vertiefen. Schauen Sie sich dazu ein Jobportal an, welches ich mit Spring implementiert habe: https://bewerbung100.de/ Die Integration verschiedener Spring-Module ermöglicht es mir, eine Vielzahl von Anwendungsfällen abzudecken und maßgeschneiderte Lösungen für meine Kunden zu entwickeln.",
    "app.android":"In der Android-Entwicklung verfüge ich ebenfalls über fundierte Kenntnisse und Erfahrungen. Meine erste Android App konnte ich an einen Vertriebspartner der EWE verkauf, den Code hierzu finden Sie in meinen Github Repositories unter DigitalAndroidPaper",
    "app.selenium":"Bei der Arbeit mit Selenium habe ich mich auf das Testen von Frontend-Anwendungen und erstellen von Automatisierungsbots spezialisiert. Durch den Einsatz von Selenide und Selenium kann ich effiziente und zuverlässige automatisierte Tests und Bots für Webanwendungen erstellen. Dies gewährleistet, dass die von mir entwickelten Anwendungen fehlerfrei sind und den Anforderungen der Kunden entsprechen.", 
    "app.javaee":"Meine Kenntnisse im Bereich JavaEE ermöglichen es mir, komplexe Enterprise-Anwendungen zu entwickeln, die auf bewährten Java-Standards und Technologien basieren.",
    "app.quarkus":"Schließlich verfüge ich auch über Grundkenntnisse in der Arbeit mit Quarkus, einem modernen und innovativen Java-Framework für die Entwicklung von Microservices und serverlosen Anwendungen. Eine Beispielimplementierung finden Sie in GitHub unter quarkus_reactive_api",
    
    "app.javascript":"Als versierter JavaScript-Entwickler bringe ich weitreichende Kenntnisse und Erfahrungen in der Arbeit mit der vielseitigen und dynamischen Skriptsprache JavaScript mit. Durch den Einsatz von JavaScript habe ich zahlreiche Webanwendungen entwickelt, die sowohl performant als auch interaktiv sind. Meine Erfahrung in der JavaScript-Entwicklung ermöglicht es mir, auf dem aktuellen Stand der Technik zu bleiben und Lösungen zu entwickeln, die den hohen Anforderungen der Benutzer entsprechen.",
    "app.react":"Im Bereich React verfüge ich über umfangreiche Kenntnisse und praktische Erfahrungen in der Entwicklung von modernen und leistungsfähigen Benutzeroberflächen. React ist mein favorisiertes Framework jedoch sehe ich mich in Zukunft meine WebApp eher mit Next, Nuxt oder Svelte programmieren.",
    "app.threejs":"Bei der Arbeit mit Three.js, einer populären 3D-Bibliothek für das Web, konnte ich meine Fähigkeiten im Bereich der 3D-Grafikentwicklung und -animation erweitern. Durch den Einsatz von Three.js bin ich in der Lage, ansprechende und interaktive 3D-Szenen und -Modelle zu erstellen, die das Engagement der Benutzer fördern und für eine immersive Erfahrung sorgen.",
    "app.materialui":"Material UI ist eine meiner bevorzugten UI-Bibliotheken für die Erstellung von responsiven und ansprechenden Webanwendungen. Mit Material UI kann ich benutzerfreundliche und ästhetisch ansprechende Komponenten entwickeln, die den Material Design-Richtlinien von Google folgen. Durch die Verwendung dieser Bibliothek stelle ich sicher, dass meine Anwendungen modern und ansprechend wirken und auf verschiedenen Geräten und Bildschirmgrößen optimal funktionieren.",
    "app.tailwind":"Mein Know-how in Tailwind CSS ermöglicht es mir, effiziente und wartbare Stylesheets für Webanwendungen zu erstellen. Als modernes CSS-Framework bietet Tailwind CSS einen utility-first-Ansatz, der die Erstellung von responsiven und anpassungsfähigen Designs erleichtert. Mit Tailwind CSS kann ich benutzerdefinierte Designs erstellen, die den Bedürfnissen meiner Kunden entsprechen, ohne dabei auf umfangreiche und schwerfällige Stylesheets zurückgreifen zu müssen.",
    "app.d3":"Bei der Arbeit mit D3.js, einer leistungsfähigen JavaScript-Bibliothek zur Datenvisualisierung, konnte ich meine Fähigkeiten im Bereich der visuellen Darstellung von Daten erweitern. Da ein großer Teil meines Studiums aus Data Science bestand und mir die Visualisierung meiner Ergebnisse besonders wichtig war beschäftigte ich mich unteranderem mit D3 und weiteren Visualierungsbibliotheken der Programmiersprache R.",
    "app.typescript":"Schließlich verfüge ich auch über Grundkenntnisse in der Arbeit mit TypeScript. Durch die Verwendung von TypeScript kann ich die Robustheit und Sicherheit meiner JavaScript-Anwendungen verbessern, indem ich Fehler bei der Kompilierung entdecke und bessere Code-Organisation und -Strukturierung durch die Nutzung von Klassen und Interfaces gewährleiste.",
    "app.reactnative":"Als engagierter Entwickler, der stets bemüht ist, sein Fachwissen zu erweitern, habe ich kürzlich begonnen, mich in React Native einzuarbeiten.",
    "app.python":"Als vielseitiger Entwickler verfüge ich auch über umfangreiche Kenntnisse und Erfahrungen in der Programmierung mit Python.",
    "app.scrapy":"Im Bereich Web-Scraping habe ich mich mit dem Einsatz von Scrapy vertraut gemacht, einem leistungsstarken Python-Framework zur Extraktion von Daten aus Webseiten. Mit Scrappy beschaffte ich mir Daten im Bereich öffentliche Verwaltung, Stellenanzeigen, Zeitungsartikeln und NFT-Daten. In Github finden Sie eine Scrapy Implementierung unter ScrapingJobData, funscraper und scrapysueddeutsche",
    "app.django":"In der Webentwicklung konnte ich meine Kenntnisse im Bereich Django vertiefen, einem der führenden Python-Webframeworks für die schnelle und effiziente Entwicklung von Webanwendungen. Projekte hierzu finden Sie auf Github unter den Namen: Rest-Api-using-Django, djangoblog und ecommercefordifferentcompanies",
    "app.pandas":"Meine Erfahrungen im Bereich der Datenanalyse und -manipulation erstrecken sich auch auf die Verwendung von Pandas, einer der wichtigsten Python-Bibliotheken für die Datenverarbeitung. Mit Pandas konnte ich legendlich Basiskenntnisse sammeln und nur testweise eine Datensets manipulieren und analysieren",
    "app.R":"In der Datenanalyse verfüge ich auch über Kenntnisse in der Programmiersprache R, die speziell für statistische Analysen und Datenvisualisierung entwickelt wurde. R ist eine leistungsfähige und flexible Sprache, die sich durch eine breite Palette von Paketen und Funktionen auszeichnet, die es ermöglichen, komplexe Analysen und Visualisierungen durchzuführen. Die umfangreiche R-Community trägt zur kontinuierlichen Erweiterung und Verbesserung der verfügbaren Ressourcen bei. Durch die Verwendung von R kann ich verschiedene statistische Modelle und Algorithmen anwenden, um Muster und Zusammenhänge in den Daten zu erkennen und aussagekräftige Erkenntnisse für Entscheidungsträger bereitzustellen. Zudem ermöglicht R die Erstellung ansprechender und interaktiver Visualisierungen, die dazu beitragen, komplexe Datenverhältnisse auf leicht verständliche Weise zu präsentieren und die Kommunikation von Ergebnissen zu erleichtern.",
    "app.php":"Durch meine Arbeit mit PHP konnte ich bisher größtenteils Erfahrungen mit Symfony sammeln",
    "app.symfony":"Im Zusammenhang mit PHP-Entwicklung habe ich mich intensiv mit dem Symfony-Framework auseinandergesetzt. Durch den Einsatz von Symfony konnte ich meine Fähigkeiten im Bereich der Webanwendungsentwicklung weiter ausbauen und anspruchsvolle Projekte unter Verwendung von bewährten Technologien und Best Practices realisieren.",
    "app.phpmyadmin":"Während meiner Arbeit mit PHP habe ich auch Erfahrungen mit phpMyAdmin gesammelt, einem beliebten webbasierten Administrationswerkzeug für MySQL- und MariaDB-Datenbanken. Mit phpMyAdmin konnte ich Datenbanken effizient verwalten und verändern, ohne auf die Kommandozeile zurückgreifen zu müssen. Dieses Werkzeug hat sich als wertvolle Ressource bei der Entwicklung von PHP-basierten Webanwendungen erwiesen.",
    "app.apiplatform":"Zudem konnte ich mich mit API Platform vertraut machen, einer modernen PHP-Framework-Lösung zur Erstellung von API-orientierten Anwendungen. API Platform hat mir die Entwicklung von REST- und GraphQL-APIs sowie die Integration von Datenpersistenz- und Validierungsschichten erleichtert.",
    "app.solidity":"Im Bereich der Blockchain-Technologie und Smart Contract-Entwicklung habe ich mich mit Solidity auseinandergesetzt, einer objektorientierten Programmiersprache für die Erstellung von Smart Contracts auf der Ethereum-Plattform. Solidity ermöglicht die Implementierung von dezentralen Anwendungen (dApps) und automatisierten Verträgen, die auf der Blockchain ausgeführt werden. Durch meine Erfahrungen mit Solidity konnte ich meine Fähigkeiten im Bereich der Blockchain-Entwicklung erweitern und innovative Lösungen für verschiedene Anwendungsfälle entwickeln.",
    "app.remix":"Bei der Arbeit mit Solidity habe ich das webbasierte IDE Remix verwendet, das speziell für die Entwicklung und das Testen von Smart Contracts entwickelt wurde. Remix bietet eine benutzerfreundliche Oberfläche, die es ermöglicht, Solidity-Code zu schreiben, zu debuggen und zu deployen. Durch die Verwendung von Remix konnte ich meine Produktivität steigern und den Entwicklungsprozess von Smart Contracts beschleunigen.",
    "app.truffle":"Ein weiteres wichtiges Werkzeug, mit dem ich mich vertraut gemacht habe, ist das Truffle Framework, das für die Entwicklung, das Testen und das Bereitstellen von Smart Contracts auf der Ethereum-Plattform konzipiert ist. Truffle bietet eine umfangreiche Toolchain, die die Entwicklung von Smart Contracts vereinfacht und optimiert. Durch die Verwendung von Truffle konnte ich meine Arbeitsabläufe verbessern und eine effiziente und strukturierte Umgebung für die Smart Contract-Entwicklung schaffen.",
    "app.ganache":"Bei der Arbeit mit Smart Contracts und Ethereum habe ich auch Erfahrungen mit Ganache gesammelt, einer persönlichen Blockchain für die Ethereum-Entwicklung. Ganache ermöglicht das Testen von Smart Contracts und dApps in einer isolierten und sicheren Umgebung, bevor sie auf das Mainnet oder Testnet deployt werden. Durch die Verwendung von Ganache konnte ich meine Smart Contracts effektiv testen und sicherstellen, dass sie wie vorgesehen funktionieren, bevor sie in einer realen Blockchain-Umgebung eingesetzt werden.",
    "app.metamask":"Schließlich habe ich auch mit MetaMask gearbeitet, einer beliebten Ethereum-Wallet und Browser-Erweiterung, die den Zugriff auf dApps und die Interaktion mit Smart Contracts ermöglicht. MetaMask bietet eine benutzerfreundliche Schnittstelle, um Ethereum-Adressen zu verwalten und Transaktionen durchzuführen. Meine Erfahrung mit MetaMask hat mir geholfen, ein besseres Verständnis für die Benutzererfahrung und die Interaktion mit dApps und Smart Contracts zu entwickeln, was mir ermöglicht, Lösungen zu entwickeln, die den Bedürfnissen der Endbenutzer gerecht werden.",
    "app.EPKBPMN": "Als Softwareentwickler habe ich Erfahrung in der Geschäftsprozessmodellierung und -analyse, insbesondere mit EPK- und BPMN-Diagrammen. Diese ermöglichen eine effektive Analyse, Optimierung und Dokumentation von Geschäftsprozessen für eine bessere Kommunikation zwischen technischen und nicht-technischen Stakeholdern.",
    "app.git": "Als Softwareentwickler beherrsche ich den Umgang mit Git für eine effiziente Verwaltung und Nachverfolgung von Codeänderungen in Projekten jeder Größe. Meine Kenntnisse umfassen das Erstellen und Verwalten von Repositories, das Arbeiten mit Branches, das Mergen von Codeänderungen, das Lösen von Merge-Konflikten und das Verwenden von Pull Requests zur Qualitätssicherung und Codeüberprüfung.",
    "app.languages": "Ich verfüge über umfangreiche Sprachkenntnisse in Deutsch, Russisch, Englisch und Spanisch sowie Anfängerkenntnisse in Chinesisch. Diese ermöglichen eine erfolgreiche Zusammenarbeit mit internationalen Teams und Kunden in verschiedenen kulturellen Kontexten.",
    "app.linux": "Meine Erfahrung im Umgang mit verschiedenen Linux-Distributionen, einschließlich Bash Scripting und Partitionierung von Festplatten, erweitert meine Fähigkeiten im Bereich der Systemadministration und der Arbeit mit Open-Source-Technologien erheblich.",
    "app.office": "Meine umfassenden Kenntnisse in Microsoft Office, insbesondere in Excel und der Programmierung mit VBA, ermöglichen die Durchführung von Datenanalysen und die Entwicklung von benutzerdefinierten Funktionen, Makros und automatisierten Lösungen in Excel.",
    "app.SAP": "Ich habe erste Erfahrungen im Umgang mit dem SAP-System gesammelt und konnte bereits grundlegende Fertigkeiten im Umgang mit der SAP-Oberfläche und verschiedenen Modulen erwerben.",
    "app.SQL": "Durch meine umfangreichen Kenntnisse in SQL kann ich effizient und präzise Daten aus verschiedenen relationalen Datenbanken abfragen, filtern und manipulieren. Diese Fähigkeiten ermöglichen datengetriebene Analysen, aussagekräftige Berichte und datenbasierte Entscheidungen.",
    "app.unity": "Ich habe erste Schritte in der Arbeit mit Unity unternommen und konnte bereits grundlegende Kenntnisse über die Plattform, ihre Arbeitsweise und die verschiedenen verfügbaren Werkzeuge erlangen.",
    "app.aws": "Durch meine Erfahrungen mit AWS konnte ich ein solides Verständnis von verschiedenen AWS-Services und deren Einsatzmöglichkeiten entwickeln, wie zum Beispiel EC2, S3, RDS und Lambda.",
    "app.Docker": "Als Anfänger in Docker konnte ich grundlegende Kenntnisse über das Konzept der Containerisierung erwerben und einfache Docker-Images erstellen und verwalten.",
    "app.firebase": "Ich habe Erfahrungen mit Firebase gesammelt, einer umfassenden Plattform von Google, die verschiedene Backend- und Infrastrukturdienste für mobile und Webanwendungen bereitstellt.",
    "app.hobbies": "Meine Hobbys sind vielfältig und spiegeln meine vielseitigen Interessen wider. Ich bin fasziniert von CryptoMining, wo ich das Zusammenspiel von Technologie und Wirtschaft erforsche. Muay Thai hält mich körperlich fit und lehrt mich Disziplin, während Yoga mir hilft, meine innere Balance zu finden. Außerdem liebe ich es, in meiner Freizeit zu zocken, da es mich in spannende virtuelle Welten entführt. Fußball ist eine weitere Leidenschaft von mir, sowohl als Spieler auf dem Feld als auch als Fan am Bildschirm oder im Stadion.",
    
    "app.nginx":"Ich habe Kenntnisse im Umgang mit Nginx, einem leistungsfähigen Webserver, Reverse-Proxy und Load-Balancer. Nginx ermöglicht mir, Webanwendungen effizient auszuliefern, den Datenverkehr effektiv zu verteilen und die Performance und Zuverlässigkeit von Anwendungen zu verbessern. Durch meine Erfahrung mit Nginx kann ich sicherstellen, dass Anwendungen schnell und sicher bereitgestellt werden.",
    "app.wildfly":"WildFly ist ein leichtgewichtiger, modularer und leistungsfähiger Java-EE-Application-Server, mit dem ich vertraut bin. Durch meine Kenntnisse in WildFly kann ich Java-EE-Anwendungen entwickeln und bereitstellen, die auf einer stabilen und erweiterbaren Plattform basieren. WildFly bietet Unterstützung für die neuesten Java-EE-Standards und ermöglicht die Integration von zusätzlichen Diensten und Technologien.",
    "app.cleancode":"In meiner Arbeit als Softwareentwickler lege ich großen Wert auf Clean Code-Prinzipien. Clean Code bezieht sich auf die Schaffung von leicht verständlichem, wartbarem und effizientem Code, der gut strukturiert und kommentiert ist. Indem ich Clean Code-Praktiken befolge, stelle ich sicher, dass mein Code für mich selbst und andere Entwickler einfach zu lesen, zu verstehen und zu erweitern ist.",
    "app.jira":"Ich habe erweiterete Erfahrung im Umgang mit Jira, nicht nur in der Nutzung sondern auch Konfiguration und Administration. Durch die Nutzung von Jira kann ich sicherstellen, dass Projekte termingerecht und erfolgreich abgeschlossen und Unternehmensprozesse optimiert werden",
    
    
    
    
    "app.confluence": "Ich habe ebenfalls umfangreiche Erfahrung mit Confluence gesammelt, nicht nur in der Anwendung, sondern auch in der Konfiguration und Administration. Durch den Einsatz von Confluence kann ich sicherstellen, dass Wissen und Informationen effizient organisiert, geteilt und innerhalb eines Teams oder einer Organisation zentral verwaltet werden. Dies ermöglicht eine effektive Zusammenarbeit und optimiert die Wissensmanagementprozesse.",
    "app.jenkins": "Ich habe Erfahrung mit Jenkins, einem Open-Source-Automatisierungsserver, der mir hilft, Continuous Integration und Continuous Delivery (CI/CD) in meinen Projekten umzusetzen. Mit meinem Wissen über Jenkins kann ich automatisierte Build-, Test- und Deployment-Pipelines einrichten, die die Qualität und Effizienz meiner Softwareentwicklung verbessern.",
    "app.googleanalytics": "Ich habe Erfahrung mit Google Analytics, einem Webanalysedienst, der mir hilft, das Nutzerverhalten auf meiner Website zu verstehen. Mit Google Analytics kann ich wichtige Metriken wie Seitenaufrufe, Besucherzahlen und Verweildauer messen und auswerten. Durch die Analyse dieser Daten kann ich meine Website kontinuierlich verbessern und die Nutzererfahrung optimieren.",
    
    "app.matomo": "In meinen Projekten habe ich auch Matomo verwendet, einen Open-Source-Webanalysedienst. Matomo bietet ähnliche Funktionen wie Google Analytics, aber ich habe mehr Kontrolle über meine Daten und kann sicherstellen, dass sie sicher und geschützt sind. Durch die Analyse von Nutzerdaten kann ich fundierte Entscheidungen treffen und meine Online-Strategie verbessern.",
    
    "app.paypalsdk": "Ich habe das PayPal SDK in meinen Projekten implementiert, um Zahlungen von Kunden zu akzeptieren. Das PayPal SDK ist einfach zu integrieren und bietet eine sichere und zuverlässige Zahlungslösung. Durch die Verwendung des PayPal SDK konnte ich die Benutzerfreundlichkeit meiner Websites verbessern und die Konversionsrate erhöhen.",
    "app.stripe": "Ich habe auch Erfahrung mit Stripe, einem Zahlungsdienstleister, der es Unternehmen ermöglicht, Online-Zahlungen zu akzeptieren. Stripe bietet eine einfache Integration und ein benutzerfreundliches Dashboard, das mir die Verwaltung von Transaktionen und die Lösung von Zahlungsproblemen ermöglicht. Durch die Verwendung von Stripe konnte ich meine Zahlungsprozesse automatisieren und die Benutzerfreundlichkeit meiner Websites verbessern.",
    "app.law": "Ich habe Kenntnisse des deutschen Datenschutzgesetzes gemäß der Allgemeinen Datenschutzverordnung (DSGVO) und Erfahrung in der Erstellung von Allgemeinen Geschäftsbedingungen (AGB) für Unternehmen. Darüber hinaus unterstütze ich öffentliche Behörden bei der Umsetzung des Onlinezugangsgesetzes (OZG) und bin mit den Anforderungen des Telemediengesetzes (TMG) für Online-Plattformen vertraut. Ich habe auch Expertise im Urheberrechtsgesetz (UrhG) und kann Unternehmen dabei helfen, Urheberrechtsverletzungen zu vermeiden und geistiges Eigentum zu schützen. Mit meinem fundierten Wissen in diesen Rechtsgebieten kann ich Unternehmen dabei helfen, rechtliche Risiken zu minimieren und ihre Geschäftsaktivitäten in Übereinstimmung mit den geltenden Gesetzen durchzuführen.",
    "app.langchain": "Durch den Einsatz von LangChain habe ich effizient eigene Chatbots mit GPT-Funktionalität entwickelt. Diese innovative Plattform ermöglicht die nahtlose Integration großer Sprachmodelle und eine breite Palette von Datenquellen, wodurch ich maßgeschneiderte Lösungen für komplexe Anforderungen bereitstellen konnte.",  
    "app.vue": "Ich habe begonnen, mich mit Vue.js zu beschäftigen, einem JavaScript-Framework, das für die Erstellung von Benutzeroberflächen verwendet wird. Trotz meiner anfänglichen Erfahrungen konnte ich bereits einige Benutzeroberflächen erstellen und pflegen, was meine Flexibilität und Effizienz bei der Entwicklung von Webanwendungen verbessert hat.",
    "app.seo": "Mit meiner Fachkompetenz in der Suchmaschinenoptimierung konnte ich die Sichtbarkeit und Reichweite verschiedener Webseiten erfolgreich steigern, was zu einer erhöhten Konversionsrate führte.",
    "app.oidc": "Durch den Einsatz von OpenID Connect in meinen Projekten konnte ich sichere und effiziente Authentifizierungslösungen für Webanwendungen bereitstellen, indem ich die Identität von Endbenutzern zuverlässig überprüfte.",
    "app.cryptomining": "Durch meine Arbeit im Bereich CryptoMining konnte ich Transaktionen von Kryptowährungen wie Bitcoin und Ethereum validieren und neue Währungseinheiten generieren, was ein tiefes Verständnis von Kryptographie und Netzwerksicherheit voraussetzt.",
    "app.cybersecurity": "Mit meinem Wissen und meiner Erfahrung in Cybersecurity konnte ich die Sicherheit von IT-Infrastrukturen gewährleisten, Datenschutzverletzungen verhindern und die Einhaltung von Sicherheitsstandards und -gesetzen sicherstellen."
    
   
   

}