{
    "app.header":"Editiere <code>{fileName}<code> js und speichern zum laden.",
    "app.content":"Moin Moin",
    "app.channel.plug":" mit {channelName}",
    "slider.title":"MEIN TISCH IST DEIN TISCH",
    "navbar.home":"Start",
    "navbar.services":"Buchungsanfrage",
    "navbar.products":"Meine Buchungen",
    "narvar.login":"Einloggen",
    "navbar.employeefinder":"Mitarbeiter Suchen",
    "navbar.adminbooking":"Admin Buchungen",
    "app.welcome":"Willkommen zu meinem Portfolio. Ich bin Artur, 28 und meine Leidenschaft ist das Programmieren. Meine favorisierten Technologien zur Zeit sind: React, Selenium, SpringBoot und Scrapy. Ich liebe es mit Code neue Dinge zu schaffen und die Entwicklung meiner Kreationen voran zutreiben.",
    "app.me":"Ich bin Artur, 28 und meine Leidenschaft ist das Programmieren. Ich liebe es mit Code neue Dinge zu schaffen und die Entwicklung meiner Kreationen voran zutreiben. ",
    "app.contact":"Hinterlassen Sie mir gerne eine Nachricht",
    "app.card1":"Die Entwicklung von Backend oder Microservices mit JavaEE oder SpringBoot/ Quarkus  Neben der Realisierung von Software gehört das Testen des Backends mit JUnit4/5 oder des Frontends mit Selenide/ Selenium ebenfalls zu meinen Stärken.",
    "app.card2":"Meine erste Android App, welche ich für einen Vertriebspartner der EWE erstellt habe, findet dort bereits ein einigen Jahren Ihren Einsatz.",
    "app.card3":"Zusätzlich empfinde ich viel Freude bei der Auswertung von Daten, welche ich mir von Zeit zu Zeit mit einem WebScraper ziehe.",
    "app.card4":"Zu den Data Science Skills mit Python und R kommen hervorangede Kenntnisse mit SQL und den dazugehörigen Tools hinzu.",
    "app.card5":"Ebenso bin ich seit Sommer letzten Jahres im Projektmanagement in der SaaS-Branche tätig und übernehme dort Verantwortung für Kundenprojekte.",
    "app.card6":"Mein Profil runden solide Skills mit in CI/ CD mit Jenkins, Version Controll mit GitHub oder GitLab unabhängig vom Bertriebssystem ab.",
    "app.card7":"Während Praktikums und des Studiums hatte ich außerdem erste Berührungspunkte mit SAP und Salesforce.",
    "app.card8":"Ein weiteres Hobby von mir ist die Spieleprogrammierung mit Unity und der Serveraufbau für Cryptomining.",
    "app.java":"Als erfahrener Java-Entwickler verfüge ich über umfassende Kenntnisse in der Programmierung mit der Java-Plattform. Durch meine jahrelange Erfahrung habe ich mich mit den verschiedenen Aspekten der Java-Entwicklung vertraut gemacht und kann effiziente, leistungsfähige und skalierbare Anwendungen erstellen, die den modernen Anforderungen des Marktes gerecht werden.",
    "app.springboot":"Im Bereich Spring Boot konnte ich mein Wissen und meine Fähigkeiten durch die Arbeit an zahlreichen Projekten weiter vertiefen. Mit Spring Boot entwickle ich leichtgewichtige, flexible und modulare Backend-Systeme und Microservices, die die Produktivität steigern und die Time-to-Market verkürzen. Die Integration verschiedener Spring-Module ermöglicht es mir, eine Vielzahl von Anwendungsfällen abzudecken und maßgeschneiderte Lösungen für meine Kunden zu entwickeln.",
    "app.android":"In der Android-Entwicklung verfüge ich ebenfalls über fundierte Kenntnisse und Erfahrungen. Ich erstelle native Android-Apps, die sowohl ansprechend als auch funktional sind. Durch die enge Zusammenarbeit mit UI/UX-Designern und die Implementierung von Best Practices in der Android-Entwicklung stelle ich sicher, dass meine Apps benutzerfreundlich, performant und sicher sind.",
    "app.selenium":"Bei der Arbeit mit Selenium habe ich mich auf das Testen von Frontend-Anwendungen spezialisiert. Durch den Einsatz von Selenide und Selenium kann ich effiziente und zuverlässige automatisierte Tests für Webanwendungen erstellen. Dies gewährleistet, dass die von mir entwickelten Anwendungen fehlerfrei sind und den Anforderungen der Kunden entsprechen.", 
    "app.javaee":"Meine Kenntnisse im Bereich JavaEE ermöglichen es mir, komplexe Enterprise-Anwendungen zu entwickeln, die auf bewährten Java-Standards und Technologien basieren. JavaEE bietet eine Vielzahl von APIs und Services, die es mir ermöglichen, skalierbare und zuverlässige Lösungen für verschiedenste Anwendungsfälle zu entwickeln und dabei stets die aktuellen Sicherheits- und Leistungsanforderungen zu berücksichtigen.",
    "app.quarkus":"Schließlich verfüge ich auch über fundierte Kenntnisse in der Arbeit mit Quarkus, einem modernen und innovativen Java-Framework für die Entwicklung von Microservices und serverlosen Anwendungen. Quarkus ermöglicht es mir, effiziente und leichtgewichtige Lösungen zu erstellen, die insbesondere für Cloud-Native-Anwendungen geeignet sind. Durch die Nutzung der Vorteile von Quarkus kann ich Anwendungen entwickeln, die schnell starten, einen geringen Speicherverbrauch haben und dennoch die volle Leistungsfähigkeit der Java-Plattform nutzen.",
    "app.javascript":"Als versierter JavaScript-Entwickler bringe ich weitreichende Kenntnisse und Erfahrungen in der Arbeit mit der vielseitigen und dynamischen Skriptsprache JavaScript mit. Durch den Einsatz von JavaScript habe ich zahlreiche Webanwendungen entwickelt, die sowohl performant als auch interaktiv sind. Meine Erfahrung in der JavaScript-Entwicklung ermöglicht es mir, auf dem aktuellen Stand der Technik zu bleiben und Lösungen zu entwickeln, die den hohen Anforderungen der Benutzer entsprechen.",
    "app.react":"Im Bereich React verfüge ich über umfangreiche Kenntnisse und praktische Erfahrungen in der Entwicklung von modernen und leistungsfähigen Benutzeroberflächen. React, eine der führenden JavaScript-Bibliotheken für die Erstellung von UI-Komponenten, ermöglicht es mir, reaktive und modularisierte Anwendungen zu erstellen, die die Benutzererfahrung verbessern und die Wartbarkeit des Codes fördern.",
    "app.threejs":"Bei der Arbeit mit Three.js, einer populären 3D-Bibliothek für das Web, konnte ich meine Fähigkeiten im Bereich der 3D-Grafikentwicklung und -animation erweitern. Durch den Einsatz von Three.js bin ich in der Lage, ansprechende und interaktive 3D-Szenen und -Modelle zu erstellen, die das Engagement der Benutzer fördern und für eine immersive Erfahrung sorgen.",
    "app.materialui":"Material UI ist eine meiner bevorzugten UI-Bibliotheken für die Erstellung von responsiven und ansprechenden Webanwendungen. Mit Material UI kann ich benutzerfreundliche und ästhetisch ansprechende Komponenten entwickeln, die den Material Design-Richtlinien von Google folgen. Durch die Verwendung dieser Bibliothek stelle ich sicher, dass meine Anwendungen modern und ansprechend wirken und auf verschiedenen Geräten und Bildschirmgrößen optimal funktionieren.",
    "app.tailwind":"Mein Know-how in Tailwind CSS ermöglicht es mir, effiziente und wartbare Stylesheets für Webanwendungen zu erstellen. Als modernes CSS-Framework bietet Tailwind CSS einen utility-first-Ansatz, der die Erstellung von responsiven und anpassungsfähigen Designs erleichtert. Mit Tailwind CSS kann ich benutzerdefinierte Designs erstellen, die den Bedürfnissen meiner Kunden entsprechen, ohne dabei auf umfangreiche und schwerfällige Stylesheets zurückgreifen zu müssen.",
    "app.d3":"Bei der Arbeit mit D3.js, einer leistungsfähigen JavaScript-Bibliothek zur Datenvisualisierung, konnte ich meine Fähigkeiten im Bereich der visuellen Darstellung von Daten erweitern. D3.js ermöglicht es mir, komplexe und interaktive Diagramme, Graphen und Karten zu erstellen, die Benutzern helfen, komplexe Datenmengen auf einfache und verständliche Weise zu analysieren und zu interpretieren.",
    "app.typescript":"Schließlich verfüge ich auch über fundierte Kenntnisse in der Arbeit mit TypeScript, einer streng typisierten Superset von JavaScript, die die Entwicklung von skalierbaren und wartbaren Webanwendungen erleichtert. Durch die Verwendung von TypeScript kann ich die Robustheit und Sicherheit meiner JavaScript-Anwendungen verbessern, indem ich Fehler bei der Kompilierung entdecke und bessere Code-Organisation und -Strukturierung gewährleiste. Die Kombination von TypeScript mit den oben genannten Technologien",
    "app.reactnative":"Als engagierter Entwickler, der stets bemüht ist, sein Fachwissen zu erweitern, habe ich kürzlich begonnen, mich in React Native einzuarbeiten.",
    "app.python":"Als vielseitiger Entwickler verfüge ich auch über umfangreiche Kenntnisse und Erfahrungen in der Programmierung mit Python, einer der populärsten und leistungsfähigsten Programmiersprachen. Python ist bekannt für seine einfache Syntax, die Lesbarkeit und die breite Anwendbarkeit in verschiedenen Bereichen wie Webentwicklung, Datenanalyse, künstlicher Intelligenz und vielem mehr. Durch die Arbeit an zahlreichen Python-Projekten konnte ich meine Fähigkeiten in der Entwicklung von effizienten, robusten und skalierbaren Lösungen weiter ausbauen.",
    "app.scrapy":"Im Bereich Web-Scraping habe ich mich mit dem Einsatz von Scrapy vertraut gemacht, einem leistungsstarken Python-Framework zur Extraktion von Daten aus Webseiten. Scrapy ermöglicht es mir, strukturierte Daten aus dem Internet zu gewinnen und diese für verschiedene Anwendungszwecke wie Datamining, Informationsbeschaffung oder Wettbewerbsanalyse zu nutzen. Durch den Einsatz von Scrapy kann ich benutzerdefinierte Crawler erstellen, die auf die spezifischen Bedürfnisse jedes Projekts zugeschnitten sind und zuverlässige und zeitnahe Daten liefern.",
    "app.django":"In der Webentwicklung konnte ich meine Kenntnisse im Bereich Django vertiefen, einem der führenden Python-Webframeworks für die schnelle und effiziente Entwicklung von Webanwendungen. Django folgt dem Model-View-Controller-Prinzip und bietet eine Vielzahl von integrierten Funktionen und Werkzeugen, die es mir ermöglichen, sichere und wartbare Anwendungen zu entwickeln. Mit Django kann ich datenbankgestützte Websites und Webanwendungen erstellen, die den Anforderungen meiner Kunden entsprechen und gleichzeitig die Entwicklungsgeschwindigkeit und -effizienz erhöhen.",
    "app.pandas":"Meine Erfahrungen im Bereich der Datenanalyse und -manipulation erstrecken sich auch auf die Verwendung von Pandas, einer der wichtigsten Python-Bibliotheken für die Datenverarbeitung. Pandas bietet leistungsstarke und flexible Datenstrukturen wie DataFrames und Series, die das Arbeiten mit großen und komplexen Datensätzen erleichtern. Durch den Einsatz von Pandas kann ich Daten effizient bereinigen, transformieren und analysieren, um wertvolle Erkenntnisse zu gewinnen und fundierte Entscheidungen auf der Grundlage von Daten zu treffen.",
    "app.R":"In der Datenanalyse verfüge ich auch über Kenntnisse in der Programmiersprache R, die speziell für statistische Analysen und Datenvisualisierung entwickelt wurde. R ist eine leistungsfähige und flexible Sprache, die sich durch eine breite Palette von Paketen und Funktionen auszeichnet, die es ermöglichen, komplexe Analysen und Visualisierungen durchzuführen. Die umfangreiche R-Community trägt zur kontinuierlichen Erweiterung und Verbesserung der verfügbaren Ressourcen bei. Durch die Verwendung von R kann ich verschiedene statistische Modelle und Algorithmen anwenden, um Muster und Zusammenhänge in den Daten zu erkennen und aussagekräftige Erkenntnisse für Entscheidungsträger bereitzustellen. Zudem ermöglicht R die Erstellung ansprechender und interaktiver Visualisierungen, die dazu beitragen, komplexe Datenverhältnisse auf leicht verständliche Weise zu präsentieren und die Kommunikation von Ergebnissen zu erleichtern.",
    "app.php":"Als erfahrener Entwickler habe ich auch mit PHP gearbeitet, einer der am häufigsten verwendeten serverseitigen Skriptsprachen. PHP hat sich seit seiner Einführung zu einer beliebten Wahl für die Webentwicklung entwickelt, da es die Erstellung von dynamischen Webseiten und Anwendungen ermöglicht. Durch meine Arbeit mit PHP konnte ich meine Kenntnisse im Bereich der serverseitigen Programmierung erweitern und zahlreiche Webprojekte erfolgreich realisieren.",
    "app.symfony":"Im Zusammenhang mit PHP-Entwicklung habe ich mich intensiv mit dem Symfony-Framework auseinandergesetzt. Symfony ist ein bekanntes PHP-Framework, das sich durch eine hohe Flexibilität und Modularität auszeichnet. Durch den Einsatz von Symfony konnte ich meine Fähigkeiten im Bereich der Webanwendungsentwicklung weiter ausbauen und anspruchsvolle Projekte unter Verwendung von bewährten Technologien und Best Practices realisieren.",
    "app.phpmyadmin":"Während meiner Arbeit mit PHP habe ich auch Erfahrungen mit phpMyAdmin gesammelt, einem beliebten webbasierten Administrationswerkzeug für MySQL- und MariaDB-Datenbanken. Mit phpMyAdmin konnte ich Datenbanken effizient verwalten und verändern, ohne auf die Kommandozeile zurückgreifen zu müssen. Dieses Werkzeug hat sich als wertvolle Ressource bei der Entwicklung von PHP-basierten Webanwendungen erwiesen.",
    "app.apiplatform":"Zudem konnte ich mich mit API Platform vertraut machen, einer modernen PHP-Framework-Lösung zur Erstellung von API-orientierten Anwendungen. API Platform erleichtert die Entwicklung von REST- und GraphQL-APIs sowie die Integration von Datenpersistenz- und Validierungsschichten. Durch die Verwendung von API Platform konnte ich hochwertige API-Schnittstellen entwickeln und den Entwicklungsprozess für komplexe Webanwendungen optimieren.",
    "app.solidity":"Im Bereich der Blockchain-Technologie und Smart Contract-Entwicklung habe ich mich mit Solidity auseinandergesetzt, einer objektorientierten Programmiersprache für die Erstellung von Smart Contracts auf der Ethereum-Plattform. Solidity ermöglicht die Implementierung von dezentralen Anwendungen (dApps) und automatisierten Verträgen, die auf der Blockchain ausgeführt werden. Durch meine Erfahrungen mit Solidity konnte ich meine Fähigkeiten im Bereich der Blockchain-Entwicklung erweitern und innovative Lösungen für verschiedene Anwendungsfälle entwickeln.",
    "app.remix":"Bei der Arbeit mit Solidity habe ich das webbasierte IDE Remix verwendet, das speziell für die Entwicklung und das Testen von Smart Contracts entwickelt wurde. Remix bietet eine benutzerfreundliche Oberfläche, die es ermöglicht, Solidity-Code zu schreiben, zu debuggen und zu deployen. Durch die Verwendung von Remix konnte ich meine Produktivität steigern und den Entwicklungsprozess von Smart Contracts beschleunigen.",
    "app.truffle":"Ein weiteres wichtiges Werkzeug, mit dem ich mich vertraut gemacht habe, ist das Truffle Framework, das für die Entwicklung, das Testen und das Bereitstellen von Smart Contracts auf der Ethereum-Plattform konzipiert ist. Truffle bietet eine umfangreiche Toolchain, die die Entwicklung von Smart Contracts vereinfacht und optimiert. Durch die Verwendung von Truffle konnte ich meine Arbeitsabläufe verbessern und eine effiziente und strukturierte Umgebung für die Smart Contract-Entwicklung schaffen.",
    "app.ganache":"Bei der Arbeit mit Smart Contracts und Ethereum habe ich auch Erfahrungen mit Ganache gesammelt, einer persönlichen Blockchain für die Ethereum-Entwicklung. Ganache ermöglicht das Testen von Smart Contracts und dApps in einer isolierten und sicheren Umgebung, bevor sie auf das Mainnet oder Testnet deployt werden. Durch die Verwendung von Ganache konnte ich meine Smart Contracts effektiv testen und sicherstellen, dass sie wie vorgesehen funktionieren, bevor sie in einer realen Blockchain-Umgebung eingesetzt werden.",
    "app.metamask":"Schließlich habe ich auch mit MetaMask gearbeitet, einer beliebten Ethereum-Wallet und Browser-Erweiterung, die den Zugriff auf dApps und die Interaktion mit Smart Contracts ermöglicht. MetaMask bietet eine benutzerfreundliche Schnittstelle, um Ethereum-Adressen zu verwalten und Transaktionen durchzuführen. Meine Erfahrung mit MetaMask hat mir geholfen, ein besseres Verständnis für die Benutzererfahrung und die Interaktion mit dApps und Smart Contracts zu entwickeln, was mir ermöglicht, Lösungen zu entwickeln, die den Bedürfnissen der Endbenutzer gerecht werden.",
    "app.EPKBPMN":"In meiner Arbeit als Softwareentwickler und Analyst habe ich mich intensiv mit Geschäftsprozessmodellierung und -analyse beschäftigt, insbesondere mit Ereignisgesteuerten Prozessketten (EPK) und der Business Process Model and Notation (BPMN). EPK-Diagramme sind eine weit verbreitete Methode zur Darstellung von Geschäftsprozessen und deren Zusammenhänge, wobei Ereignisse und Funktionen durch gerichtete Kanten verbunden sind, die den Fluss der Prozesse veranschaulichen. BPMN hingegen ist eine standardisierte grafische Notation, die speziell für die Modellierung von Geschäftsprozessen entwickelt wurde und eine größere Vielfalt an Elementen und Artefakten bietet, um komplexe Prozessstrukturen und Zusammenhänge darzustellen. Durch den Einsatz von EPK- und BPMN-Diagrammen konnte ich effektiv Geschäftsprozesse analysieren, optimieren und dokumentieren, um eine bessere Kommunikation zwischen technischen und nicht-technischen Stakeholdern zu ermöglichen und fundierte Entscheidungen zur Verbesserung der Geschäftsabläufe zu treffen.",
    "app.git":"In meiner Laufbahn als Softwareentwickler habe ich den Umgang mit Git, einem der führenden verteilten Versionskontrollsysteme, perfektioniert. Git ist ein wesentliches Werkzeug in modernen Entwicklungsprozessen und ermöglicht die effiziente Verwaltung und Nachverfolgung von Codeänderungen in Projekten jeder Größenordnung. Durch die Nutzung von Git konnte ich effektive Arbeitsabläufe etablieren, die eine kontinuierliche Integration und Zusammenarbeit im Team fördern. Meine Kenntnisse im Umgang mit Git umfassen das Erstellen und Verwalten von Repositories, das Arbeiten mit Branches, das Mergen von Codeänderungen, das Lösen von Merge-Konflikten sowie das Verwenden von Pull Requests zur Qualitätssicherung und Codeüberprüfung. Durch meine Erfahrungen mit Git bin ich in der Lage, an anspruchsvollen Projekten mit mehreren Entwicklern effizient und koordiniert zu arbeiten und dabei stets den Überblick über Codeänderungen und -versionen zu behalten.",
    "app.languages":"In meiner persönlichen und beruflichen Laufbahn habe ich ein breites Spektrum an Sprachkenntnissen erworben, die sowohl die Kommunikation als auch die Zusammenarbeit mit internationalen Teams und Kunden erleichtern. Deutsch und Russisch sind meine Muttersprachen, was mir ermöglicht, fließend und eloquent in beiden Sprachen zu kommunizieren. Mein Englisch ist auf einem sehr hohen Niveau, sodass ich komplexe technische und fachliche Themen mühelos in dieser Sprache vermitteln kann. Des Weiteren verfüge ich über solide Spanischkenntnisse, die es mir ermöglichen, grundlegende bis fortgeschrittene Unterhaltungen in dieser Sprache zu führen. Zuletzt habe ich begonnen, Chinesisch zu lernen und verfüge bereits über Anfängerkenntnisse, um einfache Gespräche zu führen und grundlegende Texte zu verstehen. Diese vielfältigen Sprachkenntnisse eröffnen mir die Möglichkeit, in verschiedenen kulturellen Kontexten erfolgreich zu arbeiten und die Anforderungen globaler Projekte zu erfüllen.",
    "app.linux":"Im Laufe meiner Karriere als Softwareentwickler und IT-Spezialist habe ich umfangreiche Kenntnisse im Umgang mit Linux und verschiedenen Linux-Distributionen erworben. Dazu gehören Distributionen wie Debian, Ubuntu und Kali, die jeweils ihre eigenen Stärken und Einsatzgebiete haben. Debian und Ubuntu sind stabile, zuverlässige und benutzerfreundliche Distributionen, die sich hervorragend für den Einsatz in Server- und Desktop-Umgebungen eignen. Kali Linux hingegen ist speziell für Sicherheitsexperten und Penetrationstester konzipiert und verfügt über eine umfangreiche Sammlung von Sicherheitswerkzeugen. Darüber hinaus besitze ich Erfahrung im Bash Scripting, was mir ermöglicht, effiziente und automatisierte Lösungen für die Verwaltung und Wartung von Linux-Systemen zu entwickeln. Schließlich habe ich mich auch mit der Partitionierung von Festplatten unter Linux auseinandergesetzt, was mir hilft, Systeme optimal einzurichten und Ressourcen effizient zu verwalten. Diese umfassenden Linux-Kenntnisse haben meine Fähigkeiten im Bereich der Systemadministration und der Arbeit mit Open-Source-Technologien erheblich erweitert.    ",
    "app.office":"Während meiner Karriere habe ich umfassende Kenntnisse im Umgang mit Microsoft Office-Produkten erworben, wobei meine stärksten Fähigkeiten im Bereich von Excel und der Programmierung mit Visual Basic for Applications (VBA) liegen. Durch die Nutzung von Excel bin ich in der Lage, komplexe Datenanalysen, Modellierungen und Visualisierungen durchzuführen, die es ermöglichen, wertvolle Erkenntnisse für Entscheidungsträger bereitzustellen. Meine Expertise in VBA erlaubt mir, benutzerdefinierte Funktionen, Makros und automatisierte Lösungen in Excel zu entwickeln, um Arbeitsabläufe effizienter zu gestalten und wiederkehrende Aufgaben zu minimieren. Die Kombination dieser Fähigkeiten hat mir ermöglicht, innovative und leistungsstarke Lösungen für eine Vielzahl von Branchen und Anwendungsfällen zu entwickeln, die die Produktivität steigern und die Entscheidungsfindung unterstützen.    ",
    "app.SAP":"In meiner beruflichen Laufbahn habe ich auch erste Erfahrungen mit dem SAP-System gesammelt, einem der führenden Anbieter von Unternehmenssoftware und Lösungen für Geschäftsprozessmanagement. Obwohl ich mich noch in einer frühen Phase der Aneignung von SAP-Kenntnissen befinde, konnte ich bereits grundlegende Fertigkeiten im Umgang mit der SAP-Oberfläche und verschiedenen Modulen erwerben. Diese Anfängerkenntnisse ermöglichen es mir, Basisfunktionalitäten von SAP zu verstehen und einfache Aufgaben innerhalb des Systems zu erledigen. Während ich mich weiterhin in die verschiedenen Aspekte von SAP vertiefe, freue ich mich darauf, meine Fähigkeiten in diesem Bereich zu erweitern und in zukünftigen Projekten effektiv einzusetzen, um Geschäftsprozesse zu optimieren und datengetriebene Entscheidungen zu unterstützen.",
    "app.salesforce":"",
    "app.SQL":"Im Laufe meiner Karriere als Softwareentwickler und Datenanalyst habe ich umfangreiche Kenntnisse in SQL, der standardisierten Abfragesprache für relationale Datenbanken, erworben. Durch meine Erfahrungen mit SQL bin ich in der Lage, effizient und präzise Daten aus verschiedenen relationalen Datenbanken wie MySQL, PostgreSQL, Oracle und SQL Server abzufragen, zu filtern und zu manipulieren. Meine guten SQL-Kenntnisse umfassen das Verständnis von Datenbankstrukturen, das Erstellen und Optimieren von Abfragen zur Datenextraktion, das Entwerfen von Tabellen und das Erstellen von Indizes, sowie das Implementieren von komplexen JOIN-Operationen und Aggregatfunktionen. Diese Fähigkeiten ermöglichen es mir, datengetriebene Analysen durchzuführen, aussagekräftige Berichte zu erstellen und datenbasierte Entscheidungen zu treffen. Außerdem tragen meine SQL-Kenntnisse dazu bei, effektive Lösungen für die Datenverwaltung und -integration in verschiedenen Projekten und Anwendungsfällen zu entwickeln.",
    "app.Unity":"In meiner Laufbahn als Softwareentwickler habe ich auch erste Schritte in der Arbeit mit Unity unternommen, einer der führenden Plattformen zur Entwicklung von 2D- und 3D-Spielen sowie interaktiven Anwendungen. Als Anfänger in Unity konnte ich bereits grundlegende Kenntnisse über die Plattform, ihre Arbeitsweise und die verschiedenen verfügbaren Werkzeuge erlangen. Ich habe begonnen, mich mit der Unity-Engine und ihrer Benutzeroberfläche vertraut zu machen, einfache Szenen und Objekte zu erstellen sowie grundlegende Skripte in C# zu schreiben, um interaktive Elemente in meinen Projekten zu steuern. Obwohl meine Kenntnisse in Unity noch auf einem Anfängerniveau sind, bin ich bestrebt, diese Fähigkeiten weiter auszubauen und in zukünftigen Projekten einzusetzen, um immersive und unterhaltsame Erfahrungen zu entwickeln, die ein breites Publikum ansprechen.",
    "app.AWS":"Durch meine Erfahrungen mit AWS habe ich ein solides Verständnis von verschiedenen AWS-Services und deren Einsatzmöglichkeiten entwickelt, wie zum Beispiel EC2 für die Bereitstellung virtueller Server, S3 für das Speichern und Abrufen von Dateien, RDS für das Verwalten von relationalen Datenbanken und Lambda für serverlose Funktionen.",
    "app.Docker":"Als Anfänger in Docker habe ich grundlegende Kenntnisse über das Konzept der Containerisierung erworben, einschließlich der Vorteile, die sie für die Entwicklung, Bereitstellung und Skalierung von Anwendungen bietet. Ich habe angefangen, Docker-Images zu erstellen, Docker-Container zu verwalten und einfache Docker-Compose-Dateien zu konfigurieren, um mehrteilige Anwendungen zu orchestrieren.",
    "app.firebase":"In meiner Laufbahn als Softwareentwickler habe ich Erfahrungen mit Firebase gesammelt, einer umfassenden Plattform von Google, die verschiedene Backend- und Infrastrukturdienste für mobile und Webanwendungen bereitstellt. Mit Firebase kann ich Echtzeitdatenbanken verwalten, Benutzerauthentifizierung implementieren, Analysen und Crash-Reporting durchführen sowie Cloud-Funktionen nutzen. Durch die Verwendung von Firebase kann ich schnell und effizient skalierbare Anwendungen entwickeln, die auf einer robusten Infrastruktur basieren.",
    "app.hobbies":"Hobbys",
    "app.nginx":"Ich habe Kenntnisse im Umgang mit Nginx, einem leistungsfähigen Webserver, Reverse-Proxy und Load-Balancer. Nginx ermöglicht mir, Webanwendungen effizient auszuliefern, den Datenverkehr effektiv zu verteilen und die Performance und Zuverlässigkeit von Anwendungen zu verbessern. Durch meine Erfahrung mit Nginx kann ich sicherstellen, dass Anwendungen schnell und sicher bereitgestellt werden.",
    "app.wildfly":"WildFly ist ein leichtgewichtiger, modularer und leistungsfähiger Java-EE-Application-Server, mit dem ich vertraut bin. Durch meine Kenntnisse in WildFly kann ich Java-EE-Anwendungen entwickeln und bereitstellen, die auf einer stabilen und erweiterbaren Plattform basieren. WildFly bietet Unterstützung für die neuesten Java-EE-Standards und ermöglicht die Integration von zusätzlichen Diensten und Technologien.",
    "app.jenkins":"Ich habe Erfahrungen mit Jenkins, einem Open-Source-Automatisierungsserver, der mir hilft, Continuous Integration und Continuous Delivery (CI/CD) in meinen Projekten zu implementieren. Durch meine Kenntnisse in Jenkins kann ich automatisierte Build-, Test- und Deployment-Pipelines einrichten, die die Qualität und Effizienz meiner Softwareentwicklung verbessern.",
    "app.cleanCode":"In meiner Arbeit als Softwareentwickler lege ich großen Wert auf Clean Code-Prinzipien. Clean Code bezieht sich auf die Schaffung von leicht verständlichem, wartbarem und effizientem Code, der gut strukturiert und kommentiert ist. Indem ich Clean Code-Praktiken befolge, stelle ich sicher, dass mein Code für mich selbst und andere Entwickler einfach zu lesen, zu verstehen und zu erweitern ist.",
    "app.jira":"Ich habe Erfahrung im Umgang mit Jira, einem weit verbreiteten Projektmanagement- und Bug-Tracking-Tool. Jira ermöglicht mir, den Fortschritt von Projekten effektiv zu verwalten, Aufgaben zuzuweisen und den Überblick über Probleme und Anforderungen zu behalten. Durch die Nutzung von Jira kann ich sicherstellen, dass Projekte termingerecht und erfolgreich abgeschlossen werden.",
    "app.confluence":"n meiner Arbeit habe ich Confluence, ein kollaboratives Wiki- und Dokumentationstool, verwendet. Confluence ermöglicht es mir, Wissen und Informationen innerhalb eines Teams oder einer Organisation zu sammeln, zu organisieren und zu teilen. Durch den Einsatz von Confluence kann ich effektiv mit meinen Kollegen zusammenarbeiten und das Wissen innerhalb meiner Projekte zentral verwalten."


}