{

    
        "app.tableButton": "Table",
        "app.doubleHelixButton": "Double Helix",
        "app.sphereButton": "Sphere",
        "app.helixButton": "Helix",
        "app.gridButton": "Grid",
        "app.circleButton": "Circle",
        "app.treeButton": "Tree",
        "app.testButton": "FractalTree",
    "app.toLeftArrow":"other programming languages",
    "app.toRightArrow":"Java",
    "app.toTopArrow":"AJAX",
    "app.toButtomArrow":"DevOps and more",
    "app.toBackToMain":"Back to Main",
    "app.welcome":"Welcome to my Portfolio, I am Artur, 28 and my passion is programming. My favorite technologies at the moment are: React, Selenium, SpringBoot and Scrapy. I love to create things through code and to take care of my creations",
    "app.contact":"Feel free to send me a mail.",
    "app.card1":"Backend development with JavaEE or SpringBoot and frontend development with React and diffrent JS libraries like three.js are my best skills. Beside software development are testing software with Junit4/5 or testing frontend with Selenide/Selenium my strenghes.",
    "app.card2":"My first android app, which I programmed for a salespartner of a big energy company to digitalize contracts is still in usage.",
    "app.card3":"Futhermore is it a pleasure for me to analyse and visualize data, which I get through a webscraper like scrapy.",
    "app.card4":"In advance to my data sciece skills with Python and R, do I have excellent skills with SQL and management tools for the latter.",
    "app.card5":"Since last summer I am working in project management for a SaaS-Company where I am responsible for my own projects.",
    "app.card6":"Solid skills in CI/ CD  with Jenkins, Version Controll with GitHub or GitLab no matter on what operating system.",
    "app.card7":"Through internships and my studies I got first experiences with SAP and Salesforce.",
    "app.card8":"Another hobby of mine is leveldesign with unity and the construction of servers for crypoto mining.",
    "app.java": "As an experienced Java developer, I have extensive knowledge in programming with the Java platform. Through my years of experience, I have familiarized myself with the various aspects of Java development and can create efficient, powerful, and scalable applications that meet the modern demands of the market.",
"app.springboot": "In the area of Spring Boot, I have deepened my knowledge and skills through working on numerous projects. With Spring Boot, I develop lightweight, flexible, and modular backend systems and microservices that increase productivity and reduce time-to-market. The integration of various Spring modules allows me to cover a wide range of use cases and develop tailor-made solutions for my clients.",
"app.android": "In Android development, I also have solid knowledge and experience. I create native Android apps that are both appealing and functional. By working closely with UI/UX designers and implementing best practices in Android development, I ensure that my apps are user-friendly, performant, and secure.",
"app.selenium": "When working with Selenium, I specialize in testing frontend applications. By using Selenide and Selenium, I can create efficient and reliable automated tests for web applications. This ensures that the applications I develop are error-free and meet the requirements of clients.",
"app.javaee": "My knowledge in the area of JavaEE allows me to develop complex enterprise applications based on proven Java standards and technologies. JavaEE offers a variety of APIs and services that enable me to develop scalable and reliable solutions for various use cases, always taking into account current security and performance requirements.",
"app.quarkus": "Finally, I also have solid knowledge working with Quarkus, a modern and innovative Java framework for developing microservices and serverless applications. Quarkus allows me to create efficient and lightweight solutions, especially suitable for cloud-native applications. By leveraging the advantages of Quarkus, I can develop applications that start quickly, have low memory consumption, and still fully utilize the capabilities of the Java platform.",
"app.javascript": "As a skilled JavaScript developer, I bring extensive knowledge and experience working with the versatile and dynamic scripting language JavaScript. Using JavaScript, I have developed numerous web applications that are both performant and interactive. My experience in JavaScript development allows me to stay current with technology and develop solutions that meet the high demands of users.",
"app.react": "In the field of React, I have extensive knowledge and practical experience in developing modern and powerful user interfaces. React, one of the leading JavaScript libraries for creating UI components, allows me to create reactive and modularized applications that enhance user experience and promote code maintainability.",
"app.threejs": "When working with Three.js, a popular 3D library for the web, I have expanded my skills in the area of 3D graphics development and animation. By using Three.js, I am able to create visually appealing and interactive 3D scenes and models that engage users and provide an immersive experience.",
"app.materialui": "Material UI is one of my preferred UI libraries for creating responsive and engaging web applications. With Material UI, I can develop user-friendly and aesthetically appealing components that follow Google's Material Design guidelines. By using this library, I ensure that my applications look modern and appealing and function optimally on various devices and screen sizes.",
"app.tailwind": "My expertise in Tailwind CSS allows me to create efficient and maintainable stylesheets for web applications. As a modern CSS framework, Tailwind CSS offers a utility-first approach that simplifies the creation of responsive and adaptable designs. With Tailwind CSS, I can create custom designs that meet my clients' needs without relying on extensive and cumbersome stylesheets.",    "app.d3":"Bei der Arbeit mit D3.js, einer leistungsfähigen JavaScript-Bibliothek zur Datenvisualisierung, konnte ich meine Fähigkeiten im Bereich der visuellen Darstellung von Daten erweitern. D3.js ermöglicht es mir, komplexe und interaktive Diagramme, Graphen und Karten zu erstellen, die Benutzern helfen, komplexe Datenmengen auf einfache und verständliche Weise zu analysieren und zu interpretieren.",
"app.typescript": "Finally, I also have in-depth knowledge in working with TypeScript, a strictly typed superset of JavaScript that makes developing scalable and maintainable web applications easier. By using TypeScript, I can improve the robustness and security of my JavaScript applications by detecting errors at compile time and ensuring better code organization and structure. The combination of TypeScript with the aforementioned technologies",
"app.reactnative": "As a committed developer who is always striving to expand my expertise, I have recently started to familiarize myself with React Native.",
"app.python": "As a versatile developer, I also have extensive knowledge and experience in programming with Python, one of the most popular and powerful programming languages. Python is known for its simple syntax, readability, and wide applicability in various fields such as web development, data analysis, artificial intelligence, and more. By working on numerous Python projects, I have been able to further enhance my skills in developing efficient, robust, and scalable solutions.",
"app.scrapy": "In the field of web scraping, I have familiarized myself with the use of Scrapy, a powerful Python framework for extracting data from websites. Scrapy allows me to obtain structured data from the internet and use it for various purposes such as data mining, information gathering, or competitive analysis. By using Scrapy, I can create custom crawlers tailored to the specific needs of each project and deliver reliable and timely data.",
"app.django": "In web development, I have deepened my knowledge in Django, one of the leading Python web frameworks for fast and efficient development of web applications. Django follows the Model-View-Controller principle and offers a variety of integrated features and tools that enable me to develop secure and maintainable applications. With Django, I can create database-backed websites and web applications that meet the requirements of my clients while also increasing development speed and efficiency.",
"app.pandas": "My experience in the field of data analysis and manipulation also extends to the use of Pandas, one of the most important Python libraries for data processing. Pandas provide powerful and flexible data structures like DataFrames and Series that facilitate working with large and complex datasets. By using Pandas, I can efficiently clean, transform, and analyze data to gain valuable insights and make data-driven decisions.",
"app.R": "In data analysis, I also have knowledge in the programming language R, which was specifically developed for statistical analysis and data visualization. R is a powerful and flexible language characterized by a wide range of packages and functions that enable complex analyses and visualizations to be performed. The extensive R community contributes to the continuous expansion and improvement of available resources. By using R, I can apply various statistical models and algorithms to identify patterns and relationships in the data and provide meaningful insights for decision-makers. Additionally, R enables the creation of appealing and interactive visualizations that help present complex data relationships in an easily understandable manner and facilitate the communication of results.",
"app.php": "As an experienced developer, I have also worked with PHP, one of the most commonly used server-side scripting languages. PHP has evolved since its introduction to become a popular choice for web development, as it enables the creation of dynamic web pages and applications. Through my work with PHP, I have been able to expand my knowledge in server-side programming and successfully realize numerous web projects.",
"app.symfony": "In connection with PHP development, I have extensively dealt with the Symfony framework. Symfony is a well-known PHP framework known for its high flexibility and modularity. By using Symfony, I have been able to further expand my skills in web application development and implement demanding projects using proven technologies and best practices." ,  

"app.phpmyadmin":"Während meiner Arbeit mit PHP habe ich auch Erfahrungen mit phpMyAdmin gesammelt, einem beliebten webbasierten Administrationswerkzeug für MySQL- und MariaDB-Datenbanken. Mit phpMyAdmin konnte ich Datenbanken effizient verwalten und verändern, ohne auf die Kommandozeile zurückgreifen zu müssen. Dieses Werkzeug hat sich als wertvolle Ressource bei der Entwicklung von PHP-basierten Webanwendungen erwiesen.",
"app.apiplatform": "Additionally, I have familiarized myself with API Platform, a modern PHP framework solution for creating API-oriented applications. API Platform simplifies the development of REST and GraphQL APIs, as well as the integration of data persistence and validation layers. By using API Platform, I have been able to develop high-quality API interfaces and optimize the development process for complex web applications.",
"app.solidity": "In the field of blockchain technology and smart contract development, I have dealt with Solidity, an object-oriented programming language for creating smart contracts on the Ethereum platform. Solidity allows for the implementation of decentralized applications (dApps) and automated contracts that run on the blockchain. Through my experience with Solidity, I have expanded my skills in blockchain development and developed innovative solutions for various use cases.",
"app.remix": "When working with Solidity, I have used the web-based IDE Remix, which was specifically designed for the development and testing of smart contracts. Remix provides a user-friendly interface that enables writing, debugging, and deploying Solidity code. By using Remix, I have been able to increase my productivity and accelerate the development process of smart contracts.",
"app.truffle": "Another important tool that I have become familiar with is the Truffle Framework, designed for the development, testing, and deployment of smart contracts on the Ethereum platform. Truffle offers a comprehensive toolchain that simplifies and optimizes the development of smart contracts. By using Truffle, I have been able to improve my workflows and create an efficient and structured environment for smart contract development.",
"app.ganache": "In working with smart contracts and Ethereum, I have also gained experience with Ganache, a personal blockchain for Ethereum development. Ganache allows for testing smart contracts and dApps in an isolated and secure environment before deploying them to the mainnet or testnet. By using Ganache, I have been able to effectively test my smart contracts and ensure they function as intended before being deployed in a real blockchain environment.",
"app.metamask": "Finally, I have also worked with MetaMask, a popular Ethereum wallet and browser extension that enables access to dApps and interaction with smart contracts. MetaMask provides a user-friendly interface for managing Ethereum addresses and conducting transactions. My experience with MetaMask has helped me gain a better understanding of user experience and interaction with dApps and smart contracts, enabling me to develop solutions that meet the needs of end-users.",
"app.EPKBPMN": "As a software developer and analyst, I have experience in business process modeling and analysis, particularly with EPK and BPMN diagrams. These enable effective analysis, optimization, and documentation of business processes for better communication between technical and non-technical stakeholders.",
"app.git": "As a software developer, I am proficient in using Git for efficient management and tracking of code changes in projects of any size. My knowledge includes creating and managing repositories, working with branches, merging code changes, resolving merge conflicts, and using pull requests for quality assurance and code review.",
"app.languages": "I have extensive language skills in German, Russian, English, and Spanish, as well as beginner knowledge in Chinese. These enable successful collaboration with international teams and clients in various cultural contexts.",
"app.linux": "My experience working with various Linux distributions, including Bash scripting and disk partitioning, significantly expands my abilities in the area of system administration and working with open-source technologies.",
"app.office": "My comprehensive knowledge of Microsoft Office, particularly in Excel and programming with VBA, allows for the execution of data analyses and the development of custom functions, macros, and automated solutions in Excel.",    
"app.SAP": "I have gained initial experience working with the SAP system and have already acquired basic skills in using the SAP interface and various modules.",
"app.SQL": "With my extensive knowledge of SQL, I can efficiently and accurately query, filter, and manipulate data from various relational databases. These skills enable data-driven analyses, meaningful reports, and data-based decisions.",
"app.unity": "I have taken the first steps in working with Unity and have already gained basic knowledge about the platform, how it works, and the various tools available.",
"app.aws": "Through my experience with AWS, I have developed a solid understanding of various AWS services and their possible uses, such as EC2, S3, RDS, and Lambda.",
"app.Docker": "As a beginner in Docker, I have acquired basic knowledge about the concept of containerization and can create and manage simple Docker images.",
"app.firebase": "I have experience with Firebase, a comprehensive platform from Google that provides various backend and infrastructure services for mobile and web applications.",
"app.hobbies": "Hobbies",
"app.nginx": "I have knowledge in working with Nginx, a powerful web server, reverse proxy, and load balancer. Nginx allows me to efficiently deliver web applications, effectively distribute traffic, and improve the performance and reliability of applications. Through my experience with Nginx, I can ensure that applications are deployed quickly and securely.",
"app.wildfly": "WildFly is a lightweight, modular, and powerful Java-EE application server with which I am familiar. With my knowledge of WildFly, I can develop and deploy Java-EE applications based on a stable and extensible platform. WildFly offers support for the latest Java-EE standards and allows the integration of additional services and technologies.",
"app.cleancode": "In my work as a software developer, I place great emphasis on Clean Code principles. Clean Code refers to the creation of easily understandable, maintainable, and efficient code that is well-structured and commented. By following Clean Code practices, I ensure that my code is easy to read, understand, and extend for myself and other developers.",
"app.jira": "I have experience working with Jira, a widely used project management and bug-tracking tool. Jira enables me to effectively manage the progress of projects, assign tasks, and keep track of issues and requirements. By using Jira, I can ensure that projects are completed on time and successfully.",

"app.confluence": "In my work, I have used Confluence, a collaborative wiki and documentation tool. Confluence allows me to gather, organize, and share knowledge and information within a team or organization. By using Confluence, I can effectively collaborate with my colleagues and centrally manage knowledge within my projects.",
"app.jenkins": "I have experience with Jenkins, an open-source automation server that helps me implement Continuous Integration and Continuous Delivery (CI/CD) in my projects. With my knowledge of Jenkins, I can set up automated build, test, and deployment pipelines that improve the quality and efficiency of my software development.",
"app.googleanalytics": "I have experience with Google Analytics, a web analytics service that helps me understand user behavior on my website. With Google Analytics, I can measure and evaluate important metrics such as page views, visitor numbers, and dwell time. By analyzing this data, I can continuously improve my website and optimize the user experience.",
"app.matomo": "In my projects, I have also used Matomo, an open-source web analytics service. Matomo offers similar features to Google Analytics, but I have more control over my data and can ensure that it is secure and protected. By analyzing user data, I can make informed decisions and improve my online strategy.",
"app.paypalsdk": "I have implemented the PayPal SDK in my projects to accept payments from customers. The PayPal SDK is easy to integrate and provides a secure and reliable payment solution. By using the PayPal SDK, I have been able to improve the user-friendliness of my websites and increase the conversion rate.",
"app.stripe": "I also have experience with Stripe, a payment service provider that allows businesses to accept payments online. Stripe offers easy integration and a user-friendly dashboard that enables me to manage transactions and solve payment issues. By using Stripe, I have been able to automate my payment processes and improve the user-friendliness of my websites.",
"app.law": "I have knowledge of German data protection law according to the General Data Protection Regulation (GDPR) and experience in creating General Terms and Conditions (GTC) for businesses. In addition, I support public authorities in implementing the Online Access Act (OZG) and am familiar with the requirements of the Telemedia Act (TMG) for online platforms. I also have expertise in the Copyright Act (UrhG) and can help businesses avoid copyright infringements and protect intellectual property. With my in-depth knowledge of these legal areas, I can help businesses minimize legal risks and conduct their business activities in compliance with applicable laws."

    
}