{
    "app.header":"Hola <code>{fileName}<code> js y la cucaracha.",
    "app.toLeftArrow": "otros lenguajes de programación",
    "app.toRightArrow": "Java",
    "app.toTopArrow": "AJAX",
    "app.toButtomArrow": "DevOps y más",
    "app.toBackToMain": "Volver al inicio", 
       "app.content":"Hola Amigo",
    "app.channel.plug":"Aprende React con {channelName}",
    "slider.title":"MI MESA ES TU MESA",
    "navbar.home":"Comenzar",
    "navbar.services":"Servicios",
    "navbar.products":"Mi Reservas",
    "narvar.login":"Acceso",
    "navbar.employeefinder":"Buscar Colega",
    "navbar.adminbooking":"Admin Reserva",
    "app.welcome":"Bienvenida a mi portafolio. Soy Artur ,tengo 28 años y mi pasión es la programación. Mis tecnologías favoritas son React, Selenium, SpringBoot and Scrapy. ",
    "app.card1":"Backend development with JavaEE or SpringBoot and frontend development with React and diffrent JS libraries like three.js are my best skills. Beside software development are testing software with Junit4/5 or testing frontend with Selenide/Selenium my strenghes.",
    "app.card2":"My first android app, which I programmed for a salespartner of a big energy company to digitalize contracts is still in usage.",
    "app.card3":"Futhermore is it a pleasure for me to analyse and visualize data, which I get through a webscraper like scrapy.",
    "app.card4":"In advance to my data sciece skills with Python and R, do I have excellent skills with SQL and management tools for the latter.",
    "app.card5":"Since last summer I am working in project management for a SaaS-Company where I am responsible for my own projects.",
    "app.card6":"Solid skills in CI/ CD  with Jenkins, Version Controll with GitHub or GitLab no matter on what operating system.",
    "app.card7":"Through internships and my studies I got first experiences with SAP and Salesforce.",
    "app.card8":"Another hobby of mine is leveldesign with unity and the construction of servers for crypoto mining.",
    "app.java": "Como desarrollador Java experimentado, tengo amplios conocimientos en programación con la plataforma Java. Puedo crear aplicaciones eficientes, potentes y escalables.",
    "app.springboot": "En el área de Spring Boot, he desarrollado sistemas de backend ligeros, flexibles y modulares, y microservicios que aumentan la productividad y reducen el tiempo de lanzamiento al mercado.",
    "app.android": "En el desarrollo de Android, también tengo experiencia. Creo aplicaciones nativas de Android atractivas y funcionales, garantizando que sean fáciles de usar, con buen rendimiento y seguras.",
    "app.selenium": "Con Selenium, me especializo en probar aplicaciones frontend. Uso Selenide y Selenium para crear pruebas automatizadas eficientes y confiables, asegurando aplicaciones sin errores.",
    "app.javaee": "Mis conocimientos en JavaEE me permiten desarrollar aplicaciones empresariales complejas, escalables y confiables, teniendo en cuenta los requisitos de seguridad y rendimiento.",
    "app.quarkus": "Tengo experiencia con Quarkus, un marco Java para desarrollar microservicios y aplicaciones sin servidor, creando soluciones eficientes y ligeras, especialmente para aplicaciones nativas en la nube.",
    "app.javascript": "Como desarrollador JavaScript, he desarrollado numerosas aplicaciones web rápidas e interactivas, manteniéndome actualizado con la tecnología y desarrollando soluciones que cumplen con las exigencias de los usuarios.",
    "app.react": "En React, tengo experiencia en desarrollar interfaces de usuario modernas y potentes, mejorando la experiencia del usuario y promoviendo la mantenibilidad del código.",
    "app.threejs": "Con Three.js, una popular biblioteca 3D web, he ampliado mis habilidades en gráficos 3D y animación, creando escenas y modelos 3D atractivos e interactivos.",
    "app.materialui": "Material UI es una de mis bibliotecas UI preferidas para crear aplicaciones web atractivas y adaptables, siguiendo las pautas de Material Design de Google.",
    "app.tailwind": "Mi experiencia en Tailwind CSS me permite crear hojas de estilo eficientes y mantenibles, facilitando la creación de diseños adaptativos.",
    "app.d3": "Con D3.js, una biblioteca de visualización de datos, puedo crear diagramas, gráficos y mapas complejos e interactivos para analizar e interpretar datos.",
    "app.typescript": "También tengo conocimientos en TypeScript, un superset tipado de JavaScript que facilita el desarrollo de aplicaciones web escalables y mantenibles.",
    "app.reactnative": "Como desarrollador comprometido, recientemente comencé a familiarizarme con React Native.",
    "app.python": "También tengo experiencia en programación con Python, un lenguaje versátil y potente, mejorando mis habilidades en soluciones eficientes, sólidas y escalables.",
    "app.scrapy": "En web scraping, me familiaricé con Scrapy, un potente marco de Python para extraer datos de sitios web, creando crawlers personalizados para cada proyecto.",
    "app.django": "In web development, I have deepened my knowledge in Django, one of the leading Python web frameworks for fast and efficient development of web applications. Django follows the Model-View-Controller principle and offers a variety of integrated features and tools that enable me to develop secure and maintainable applications. With Django, I can create database-backed websites and web applications that meet the requirements of my clients while also increasing development speed and efficiency.",
    "app.pandas": "Mi experiencia en análisis y manipulación de datos incluye Pandas, una importante biblioteca de Python para procesamiento de datos. Con Pandas, puedo analizar datos de manera eficiente y tomar decisiones basadas en datos.",
    "app.R": "También tengo conocimientos en R, un lenguaje de programación específico para análisis estadístico y visualización de datos. Con R, puedo aplicar modelos estadísticos y crear visualizaciones atractivas e interactivas.",
    "app.php": "Como desarrollador experimentado, he trabajado con PHP, un popular lenguaje de scripting del lado del servidor. Con PHP, he expandido mi conocimiento en programación del lado del servidor y realizado numerosos proyectos web.",
    "app.symfony": "En relación con PHP, he trabajado con el marco Symfony. Symfony es un marco PHP flexible y modular que me permite expandir mis habilidades en desarrollo web y aplicar tecnologías y buenas prácticas probadas.",
    
    "app.phpmyadmin": "En mi trabajo con PHP, también he adquirido experiencia con phpMyAdmin, una herramienta de administración web para bases de datos MySQL y MariaDB, útil en el desarrollo de aplicaciones web basadas en PHP.",
    "app.apiplatform": "Además, me he familiarizado con API Platform, un marco de PHP para crear aplicaciones orientadas a API. Con API Platform, puedo desarrollar interfaces de API de alta calidad y optimizar el proceso de desarrollo para aplicaciones web complejas.",
    "app.solidity": "En el campo de blockchain y desarrollo de contratos inteligentes, he trabajado con Solidity, un lenguaje de programación orientado a objetos para crear contratos en la plataforma Ethereum. Con Solidity, he expandido mis habilidades en desarrollo blockchain.",
    "app.remix": "Con Solidity, he usado Remix, un IDE web para desarrollar y probar contratos inteligentes. Remix proporciona una interfaz fácil de usar para escribir, depurar y desplegar código Solidity, aumentando mi productividad.",
    "app.truffle": "Me he familiarizado con Truffle Framework, diseñado para el desarrollo de contratos inteligentes en Ethereum. Truffle optimiza el desarrollo y mejora mis flujos de trabajo en el entorno de contratos inteligentes.",
    "app.ganache": "También tengo experiencia con Ganache, una blockchain personal para el desarrollo de Ethereum. Ganache permite probar contratos y dApps de manera aislada y segura antes de desplegarlos en la red principal o de prueba.",
    "app.metamask": "He trabajado con MetaMask, una billetera Ethereum y extensión de navegador que permite acceder a dApps e interactuar con contratos inteligentes. Mi experiencia con MetaMask me ayuda a comprender mejor la experiencia del usuario.",
    "app.EPKBPMN": "Como desarrollador y analista, tengo experiencia en modelado y análisis de procesos de negocio, especialmente con diagramas EPK y BPMN. Estos permiten la optimización y documentación efectiva de procesos de negocio para una mejor comunicación entre los interesados técnicos y no técnicos.",
    "app.git": "Como desarrollador de software, tengo habilidad en el uso de Git para gestionar y rastrear cambios de código en proyectos de cualquier tamaño. Mi conocimiento incluye crear y administrar repositorios, trabajar con ramas, fusionar cambios de código, resolver conflictos de fusión y usar solicitudes de extracción para garantizar la calidad y revisar el código.",

    "app.languages": "Tengo habilidades lingüísticas en alemán, ruso, inglés y español, así como conocimientos básicos de chino. Esto me permite colaborar con equipos y clientes internacionales en diferentes contextos culturales.",
    "app.linux": "Mi experiencia con distribuciones Linux, incluyendo Bash scripting y particionamiento de disco, amplía mis habilidades en administración de sistemas y tecnologías de código abierto.",
    "app.office": "Mi conocimiento de Microsoft Office, especialmente Excel y programación con VBA, permite realizar análisis de datos y desarrollar soluciones personalizadas y automatizadas en Excel.",
    "app.SAP": "He obtenido experiencia inicial con el sistema SAP y ya he adquirido habilidades básicas en el uso de su interfaz y varios módulos.",
    "app.SQL": "Con mis conocimientos de SQL, puedo consultar y manipular datos de bases de datos relacionales de manera eficiente. Estas habilidades permiten análisis basados en datos y toma de decisiones informada.",
    "app.unity": "He dado los primeros pasos con Unity y he adquirido conocimientos básicos sobre la plataforma y sus herramientas.",
    "app.aws": "Mi experiencia con AWS me ha proporcionado un sólido entendimiento de sus servicios, como EC2, S3, RDS y Lambda.",

"app.Docker": "Tengo conocimientos básicos sobre la contenerización y puedo crear y gestionar imágenes Docker simples.",
"app.firebase": "Tengo experiencia con Firebase, plataforma de Google que ofrece servicios de backend e infraestructura para aplicaciones móviles y web.",
"app.hobbies": "Aficiones",
"app.nginx": "Conozco Nginx, servidor web potente y balanceador de carga, que permite entregar aplicaciones eficientemente y distribuir tráfico.",
"app.wildfly": "Estoy familiarizado con WildFly, un servidor de aplicaciones Java-EE ligero y modular que permite desarrollar y desplegar aplicaciones Java-EE.",
"app.cleancode": "En mi trabajo, hago hincapié en los principios de Clean Code, creando código fácil de entender, mantener y estructurar correctamente.",
"app.jira": "Tengo experiencia con Jira, herramienta de gestión de proyectos y seguimiento de errores, que permite administrar proyectos y tareas eficazmente.",

"app.confluence": "He usado Confluence, herramienta de documentación colaborativa que permite organizar y compartir conocimientos en equipos u organizaciones.",
"app.jenkins": "Tengo experiencia con Jenkins, servidor de automatización que permite implementar Integración Continua y Entrega Continua (CI/CD) en proyectos.",
"app.googleanalytics": "He trabajado con Google Analytics, servicio de análisis web que me ayuda a entender el comportamiento de los usuarios en mis sitios web.",
"app.matomo": "He usado Matomo, servicio de análisis web de código abierto que ofrece control sobre mis datos y garantiza su seguridad y protección.",
"app.paypalsdk": "He implementado el SDK de PayPal en proyectos para aceptar pagos de clientes, proporcionando una solución de pago segura y confiable.",
"app.stripe": "Tengo experiencia con Stripe, proveedor de servicios de pago que permite aceptar pagos en línea y gestionar transacciones fácilmente.",
"app.law": "Conozco la ley de protección de datos alemana (GDPR) y he creado Términos y Condiciones Generales (GTC) para negocios, ayudando a minimizar riesgos legales."
    
}