{
    
    "app.tableButton": "Таблица",
"app.doubleHelixButton": "Двойная спираль",
"app.sphereButton": "Сфера",
"app.helixButton": "Спираль",
"app.gridButton": "Сетка",
"app.circleButton": "Круг",
"app.treeButton": "Дерево",
"app.testButton": "Фрактальное дерево",


    "app.header":"Привет <code>{fileName}<code> js and save to reload.",
    "app.toLeftArrow": "другие языки программирования",
    "app.toRightArrow": "Java",
    "app.toTopArrow": "AJAX",
    "app.toButtomArrow": "DevOps и многое другое",
    "app.toBackToMain": "Вернуться на главную",

    "app.content":"Привет Привет",
    "app.channel.plug":"Привет Привет Привет {channelName}",
    "slider.title":"Мой стол твой стол",
    "navbar.home":"Начинать",
    "navbar.services":"Сервисы",
    "navbar.products":"мои бронирования",
    "narvar.login":"авторизоваться",
    "navbar.employeefinder":"митарбайтер авторизоваться",
    "navbar.adminbooking":"Админ резервирование",
    "app.welcome":"Добро пожаловать в мой портфель, меня зовут Артур, 28 лет и моё призвание это программирование. Мои любимые технологии React, Selenium, SpringBoot и Scrapy.    ",
    "app.contact":"Пожалуйста, оставьте мне сообщение",
    "app.card1":"Backend development with JavaEE or SpringBoot and frontend development with React and diffrent JS libraries like three.js are my best skills. Beside software development are testing software with Junit4/5 or testing frontend with Selenide/Selenium my strenghes.",
    "app.card2":"My first android app, which I programmed for a salespartner of a big energy company to digitalize contracts is still in usage.",
    "app.card3":"Futhermore is it a pleasure for me to analyse and visualize data, which I get through a webscraper like scrapy.",
    "app.card4":"In advance to my data sciece skills with Python and R, do I have excellent skills with SQL and management tools for the latter.",
    "app.card5":"Since last summer I am working in project management for a SaaS-Company where I am responsible for my own projects.",
    "app.card6":"Solid skills in CI/ CD  with Jenkins, Version Controll with GitHub or GitLab no matter on what operating system.",
    "app.card7":"Through internships and my studies I got first experiences with SAP and Salesforce.",
    "app.card8":"Another hobby of mine is leveldesign with unity and the construction of servers for crypoto mining.",
    "app.java": "Будучи опытным Java-разработчиком, я обладаю обширными знаниями в программировании на платформе Java. За многие годы опыта я ознакомился с различными аспектами разработки на Java и могу создавать эффективные, производительные и масштабируемые приложения, соответствующие современным требованиям рынка.",
"app.springboot": "В области Spring Boot я расширил свои знания и навыки, работая над множеством проектов. С помощью Spring Boot я разрабатываю легковесные, гибкие и модульные бэкенд-системы и микросервисы, которые повышают производительность и сокращают время выхода на рынок. Интеграция различных модулей Spring позволяет мне охватывать множество сценариев использования и разрабатывать индивидуальные решения для моих клиентов.",
"app.android": "В разработке Android я также обладаю глубокими знаниями и опытом. Я создаю нативные Android-приложения, которые являются как привлекательными, так и функциональными. Тесное сотрудничество с UI/UX-дизайнерами и использование передовых методов разработки Android позволяют мне гарантировать, что мои приложения удобны для пользователей, производительны и безопасны.",
"app.selenium": "Работая с Selenium, я специализировался на тестировании фронтенд-приложений. Используя Selenide и Selenium, я могу создавать эффективные и надежные автоматизированные тесты для веб-приложений. Это гарантирует, что разработанные мной приложения безошибочны и соответствуют требованиям клиентов.",
"app.javaee": "Мои знания в области JavaEE позволяют мне разрабатывать сложные корпоративные приложения, основанные на проверенных стандартах и технологиях Java. JavaEE предлагает множество API и сервисов, которые позволяют мне разрабатывать масштабируемые и надежные решения для разнообразных сценариев использования, учитывая при этом текущие требования безопасности и производительности.",
"app.quarkus": "Наконец, у меня также есть обширные знания в работе с Quarkus, современным и инновационным Java-фреймворком для разработки микросервисов и serverless-приложений. Quarkus позволяет мне создавать эффективные и легковесные решения, особенно подходящие для приложений, ориентированных на облачные технологии. Используя преимущества Quarkus, я могу разрабатывать приложения, которые быстро запускаются, имеют небольшой объем потребляемой памяти и при этом используют все возможности платформы Java.",
"app.javascript": "Будучи опытным разработчиком на JavaScript, я обладаю обширными знаниями и опытом работы с многофункциональным и динамическим языком программирования JavaScript. Применяя JavaScript, я разработал многочисленные веб-приложения, которые являются производительными и интерактивными. Мой опыт в разработке на JavaScript позволяет мне быть в курсе последних технологий и разрабатывать решения, соответствующие высоким требованиям пользователей.",
"app.react": "В области React я обладаю обширными знаниями и практическим опытом в разработке современных и производительных пользовательских интерфейсов. React, одна из ведущих JavaScript-библиотек для создания UI-компонентов, позволяет мне создавать реактивные и модульные приложения, улучшающие пользовательский опыт и способствующие поддержке кода.",
"app.threejs": "Работая с Three.js, популярной 3D-библиотекой для веба, я расширил свои навыки в области 3D-графики и анимации. Используя Three.js, я могу создавать привлекательные и интерактивные 3D-сцены и модели, которые повышают вовлеченность пользователей и обеспечивают погружение в опыт.", "app.materialui":"Material UI ist eine meiner bevorzugten UI-Bibliotheken für die Erstellung von responsiven und ansprechenden Webanwendungen. Mit Material UI kann ich benutzerfreundliche und ästhetisch ansprechende Komponenten entwickeln, die den Material Design-Richtlinien von Google folgen. Durch die Verwendung dieser Bibliothek stelle ich sicher, dass meine Anwendungen modern und ansprechend wirken und auf verschiedenen Geräten und Bildschirmgrößen optimal funktionieren.",
"app.tailwind": "Мои навыки работы с Tailwind CSS позволяют мне создавать эффективные и легко поддерживаемые таблицы стилей для веб-приложений. Как современный CSS-фреймворк, Tailwind CSS предлагает подход, основанный на утилитах, который облегчает создание адаптивных и гибких дизайнов. Используя Tailwind CSS, я могу создавать пользовательские дизайны, которые соответствуют потребностям моих клиентов, без необходимости использования громоздких и сложных таблиц стилей.",
"app.d3": "Работая с D3.js, мощной JavaScript-библиотекой для визуализации данных, я расширил свои навыки в области визуализации данных. D3.js позволяет мне создавать сложные и интерактивные диаграммы, графики и карты, которые помогают пользователям анализировать и интерпретировать большие объемы данных простым и понятным образом.",
"app.typescript": "Наконец, у меня также есть глубокие знания в работе с TypeScript, строго типизированным надмножеством JavaScript, которое облегчает разработку масштабируемых и поддерживаемых веб-приложений. Используя TypeScript, я могу улучшить надежность и безопасность своих JavaScript-приложений, обнаруживая ошибки при компиляции и обеспечивая лучшую организацию и структурирование кода. Комбинирование TypeScript с вышеупомянутыми технологиями",
"app.reactnative": "Будучи преданным разработчиком, который постоянно стремится расширить свои профессиональные знания, я недавно начал изучать React Native.",
"app.python": "Как разносторонний разработчик, я также обладаю обширными знаниями и опытом программирования на Python, одном из самых популярных и мощных языков программирования. Python известен своим простым синтаксисом, читабельностью и широким применением в различных областях, таких как веб-разработка, анализ данных, искусственный интеллект и многие другие.",

"app.scrapy": "В области веб-скрапинга я ознакомился с использованием Scrapy, мощного Python-фреймворка для извлечения данных с веб-сайтов. Scrapy позволяет мне получать структурированные данные из интернета и использовать их для различных целей, таких как добыча данных, сбор информации или конкурентный анализ. Используя Scrapy, я могу создавать настраиваемые сборщики данных, адаптированные под конкретные потребности каждого проекта и предоставлять надежные и актуальные данные.",
"app.django": "В веб-разработке я углубил свои знания в Django, одном из ведущих веб-фреймворков Python для быстрой и эффективной разработки веб-приложений. Django следует принципу Model-View-Controller и предлагает множество интегрированных функций и инструментов, которые позволяют мне разрабатывать безопасные и поддерживаемые приложения. С Django я могу создавать сайты и веб-приложения с поддержкой баз данных, соответствующие требованиям моих клиентов, и при этом повышать скорость и эффективность разработки.",
"app.pandas": "Мой опыт работы в области анализа и обработки данных также охватывает использование Pandas, одной из самых важных библиотек Python для обработки данных. Pandas предоставляет мощные и гибкие структуры данных, такие как DataFrames и Series, которые облегчают работу с большими и сложными наборами данных. Используя Pandas, я могу эффективно очищать, преобразовывать и анализировать данные, чтобы получить ценные результаты и принимать решения на основе данных.",
"app.R": "В анализе данных у меня также есть знания в языке программирования R, который был разработан специально для статистического анализа и визуализации данных. R - это мощный и гибкий язык, характеризующийся широким диапазоном пакетов и функций, которые позволяют выполнять сложные анализы и визуализации. Обширное сообщество R способствует непрерывному расширению и улучшению доступных ресурсов.",

"app.php": "Как опытный разработчик, я также работал с PHP, одним из наиболее распространенных языков скриптов для серверной части. С момента своего появления PHP эволюционировал и стал популярным выбором для веб-разработки, так как он позволяет создавать динамические веб-страницы и приложения. Работая с PHP, я смог расширить свои знания в программировании на стороне сервера и успешно реализовать множество веб-проектов.",
"app.symfony": "В связи с разработкой на PHP, я много работал с фреймворком Symfony. Symfony - это известный PHP-фреймворк, известный своей высокой гибкостью и модульностью. Используя Symfony, я смог расширить свои навыки в разработке веб-приложений и реализовать сложные проекты с использованием проверенных технологий и передовых практик.",

"app.phpmyadmin": "Во время работы с PHP я также набрался опыта в использовании phpMyAdmin, популярного веб-инструмента администрирования для баз данных MySQL и MariaDB. С помощью phpMyAdmin мне удалось эффективно управлять и изменять базы данных без обращения к командной строке. Этот инструмент оказался ценным ресурсом при разработке веб-приложений на основе PHP.",
"app.apiplatform": "Кроме того, я ознакомился с API Platform, современным решением на базе PHP-фреймворка для создания приложений, ориентированных на API. API Platform упрощает разработку REST и GraphQL API, а также интеграцию слоев постоянного хранения данных и валидации. Используя API Platform, я смог разработать высококачественные API-интерфейсы и оптимизировать процесс разработки для сложных веб-приложений.",
"app.solidity": "В области блокчейна и разработки смарт-контрактов я использовал Solidity - язык программирования для создания смарт-контрактов на Ethereum. Solidity позволяет реализовать децентрализованные приложения (dApps) и контракты на блокчейне. Мой опыт с Solidity расширил навыки в разработке блокчейна и инновационных решений.",
"app.remix": "Работая с Solidity, я использовал веб-IDE Remix для разработки и тестирования смарт-контрактов. Remix обеспечивает удобный интерфейс для написания, отладки и развертывания кода Solidity, что повышает продуктивность.",
"app.truffle": "Я также ознакомился с Truffle Framework для разработки, тестирования и развертывания смарт-контрактов на Ethereum. Truffle упрощает и оптимизирует разработку смарт-контрактов, что позволяет улучшить рабочие процессы.",
"app.ganache": "Работая с смарт-контрактами и Ethereum, я использовал Ganache - личный блокчейн для разработки Ethereum. Ganache позволяет тестировать смарт-контракты и dApps в безопасной среде перед развертыванием в основной сети.",
"app.metamask": "Наконец, я работал с MetaMask - популярным кошельком Ethereum и расширением браузера для доступа к dApps и взаимодействия с смарт-контрактами. Опыт с MetaMask помог мне лучше понять взаимодействие пользователей с dApps и смарт-контрактами, позволяя разрабатывать решения, отвечающие потребностям конечных пользователей.",

"app.EPKBPMN": "Как разработчик и аналитик, я имею опыт моделирования и анализа бизнес-процессов с помощью EPK и BPMN диаграмм. Это способствует анализу, оптимизации и документированию бизнес-процессов для лучшего общения между техническими и нетехническими участниками.",
"app.git": "Как программист, я умею работать с Git для управления и отслеживания изменений кода в проектах любого размера. Умею создавать репозитории, работать с ветками, объединять изменения, решать конфликты и использовать запросы на проверку кода.",
"app.languages": "Владею немецким, русским, английским и испанским языками, а также начальным уровнем китайского. Это позволяет успешно сотрудничать с международными командами и клиентами.",
"app.linux": "Мой опыт работы с различными дистрибутивами Linux, включая Bash-скрипты и разбиение диска, расширяет возможности в области системного администрирования и работы с открытыми технологиями.",
"app.office": "Знание Microsoft Office, особенно Excel и программирование с VBA, позволяет выполнять анализ данных и разрабатывать автоматизированные решения в Excel.",
"app.SAP": "Я приобрел начальный опыт работы с системой SAP и освоил базовые навыки использования интерфейса SAP и различных модулей.",
"app.SQL": "Обладая знанием SQL, могу эффективно работать с данными различных реляционных баз данных, выполнять анализ, отчеты и принимать решения на основе данных.",
"app.unity": "Сделал первые шаги в работе с Unity, изучил основы платформы и доступные инструменты.",
"app.aws": "Опыт с AWS позволяет мне разбираться в различных сервисах AWS, таких как EC2, S3, RDS и Lambda.",
"app.Docker": "Освоил базовые знания о концепции контейнеризации и управлении Docker-образами.",
"app.firebase": "Имею опыт работы с Firebase - платформой от Google для мобильных и веб-приложений.",
"app.hobbies": "Увлечения",
"app.nginx": "Владею Nginx - мощным веб-сервером, обратным прокси и балансировщиком нагрузки, позволяющим эффективно развертывать приложения.",
"app.wildfly": "Знаком с WildFly - легковесным и мощным сервером приложений Java-EE.",
"app.cleancode": "Следую принципам чистого кода для создания понятного и поддерживаемого кода.",
"app.jira": "Имею опыт работы с Jira для управления проектами и отслеживания ошибок.",
"app.confluence": "Использую Confluence для совместной работы над документацией и обмена знаниями.",
"app.jenkins": "Опыт работы с Jenkins для автоматизации процессов CI/CD в проектах.",
"app.googleanalytics": "Опыт использования Google Analytics для анализа поведения пользователей и оптимизации сайта.",
"app.matomo": "В своих проектах я также использовал Matomo, сервис веб-аналитики с открытым исходным кодом. Matomo предлагает возможности, аналогичные Google Analytics, но с большим контролем над данными и их безопасностью. Анализируя данные пользователей, я принимаю обоснованные решения и улучшаю свою онлайн-стратегию.",
"app.paypalsdk": "Я использовал PayPal SDK в своих проектах для приема платежей от клиентов. PayPal SDK легко интегрируется и предоставляет безопасное и надежное решение для оплаты. Используя PayPal SDK, я смог улучшить удобство использования моих сайтов и увеличить конверсию.",
"app.stripe": "У меня также есть опыт работы со Stripe, провайдером платежных услуг, который позволяет принимать платежи онлайн. Stripe предлагает простую интеграцию и удобную панель управления, которая позволяет мне управлять транзакциями и решать проблемы с оплатой. Используя Stripe, я смог автоматизировать свои платежные процессы и улучшить удобство использования моих сайтов.",
"app.law": "Я знаком с немецким законом о защите данных в соответствии с Общим регламентом по защите данных (GDPR) и имею опыт создания Общих условий и положений (GTC) для предприятий. Кроме того, я помогаю органам власти в реализации Закона об онлайн-доступе (OZG) и знаком с требованиями Закона о телемедиа (TMG) для онлайн-платформ. У меня также есть экспертиза в Законе об авторском праве (UrhG), и я могу помочь компаниям избегать нарушений авторских прав и защищать интеллектуальную собственность. Благодаря глубоким знаниям в этих правовых областях, я могу помочь компаниям минимизировать юридические риски и вести свою деятельность в соответствии с действующим законодательством."

}